examples/stress/artillery/test.yml
config:
  target: "ws://localhost:8080/ws"
  phases:
    - duration: 30
      arrivalRate: 5
    - duration: 60
      rampTo: 10
    - duration: 120
      rampTo: 20

scenarios:
  - name: "sendjson"
    engine: ws
    flow:
      - loop:
          - send:
              json: '{"message": "Hello, World!"}'
          - think: 1
        count: 120
      - send:
          json: '{"message": "Goodbye"}'
      - think: 5